bdd/MCD_uml.puml
' Generated by Mocodo 4.2.8

@startuml "MCD"

!define Table(x) class "x" << (T,#c7eae5) >>
!define pk(x) <b>x</b>
hide methods
left to right direction
skinparam groupInheritance 2
skinparam lineThickness 3
skinparam lineColor #bf812d
skinparam backgroundColor #f5f5f5
skinparam classAttributeFontColor #000000
skinparam classAttributeFontName Monospaced
skinparam classAttributeFontSize 14
skinparam classBackgroundColor #c7eae5
skinparam classBorderColor #35978f
skinparam classBorderThickness 3
skinparam classFontColor #000000
skinparam classFontName Arial
skinparam classFontSize 18
skinparam classHeaderBackgroundColor #80cdc1

Table("Categories") {
    {field} + pk(id)
    {field} + name
    {field} + slug
    {field} + created_at
    {field} + updated_at
}

"Posts" "1" --- "*" "Categories": "belongs_to"

Table("Posts") {
    {field} + pk(id)
    {field} + name
    {field} + slug
    {field} + excerpt
    {field} + content
    {field} + thumbnail
    {field} + created_at
    {field} + updated_at
}

Table("SubTypes") {
    {field} + pk(id)
    {field} + name
    {field} + slug
    {field} + created_at
    {field} + updated_at
}

"Encyclopedia_SubTypes" "1" --- "*" "SubTypes": "part_of"

Table("Encyclopedia_SubTypes") {
    {field} + pk(id)
    {field} + encyclopedia_id
    {field} + subtype_id
    {field} + created_at
    {field} + updated_at
}

"Encyclopedia_SubTypes" "1" --- "*" "Encyclopedias": "has_subtypes"

Table("Types") {
    {field} + pk(id)
    {field} + name
    {field} + slug
    {field} + created_at
    {field} + updated_at
}

"Comments" "1" --- "*" "Posts": "has_comments"

Table("Comments") {
    {field} + pk(id)
    {field} + content
    {field} + created_at
    {field} + updated_at
}

"Comments" "1" --- "*" "Users": "authored_by"

Table("Users") {
    {field} + pk(id)
    {field} + pseudo
    {field} + avatar
    {field} + rgpd
    {field} + newsletters
    {field} + role
    {field} + created_at
    {field} + updated_at
}

Table("Encyclopedias") {
    {field} + pk(id)
    {field} + title
    {field} + content
    {field} + thumbnail
    {field} + created_at
    {field} + updated_at
}

"Encyclopedias" "1" --- "*" "Types": "of_type"

@enduml
